app/Http/Controllers/AfiliadoController.php

select * from `afiliados` where `Nombre` LIKE '%%' order by `id` desc limit 7 offset 0
select * from `estado_civils` where `estado_civils`.`id` in (1, 3, 4)
select * from `generos` where `generos`.`id` in (1, 2)
select count(*) as aggregate from `afiliados` where `Nombre` LIKE '%%'
select * from `generos`
select * from `estado_civils`
---
    public function index(Request $request)
    {
      if($request){
        $query=trim($request->get('searchText')); //valida si la peticion trae el campo de busqueda
        $afi= Afiliado::with('Genero', 'Estado_Civil')
            ->where('Nombre','LIKE','%'.$query.'%')
            ->orderby('id','ASC')
            ->paginate(7);
            $genero = Genero::all();
            $estadoC = Estado_Civil::all();