app/Http/Controllers/AfiliadoApiarioController.php

    public function create()
    {
        $Afiliados = Afiliado::all();

        $Apiarios = Apiario::all();
---
select * from `afiliados`
select * from `apiarios`