app/Http/Controllers/ApiarioController.php

select * from `apiarios` where `Descripcion` LIKE '%%' order by `id` desc limit 7 offset 0
select * from `ubicacions` where `ubicacions`.`id` in (1, 2, 3, 4)
select count(*) as aggregate from `apiarios` where `Descripcion` LIKE '%%'
select * from `ubicacions`
---
    public function index(Request $request)
    {
        if($request){
            $query=trim($request->get('searchText'));  //valida si la peticion trae el campo de busqueda
        $api = Apiario::with('Ubicacion')
            ->where('Descripcion','LIKE','%'.$query.'%')
            ->orderby('id','desc')
            ->paginate(7);

           $ubicaciones = Ubicacion::all();