app/Http/Controllers/EstanonController.php

select * from `estanons` where `id` LIKE '%%' order by `id` desc limit 7 offset 0
select count(*) as aggregate from `estanons` where `id` LIKE '%%'
---
    public function index(Request $request)
    {
        if ($request)
        {
            $query=trim($request->get('searchText'));
            $estanon=DB::table('estanons')->where('id','LIKE','%'.$query.'%')
            ->orderby('id','desc')
            ->paginate(7);