app/Http/Controllers/RecepcionMateriaPrimaController.php

public function index(Request $request){
   if ($request)
    {
        $search = \Request::get('search');
        $recepcion = RecepcionMateriaPrima::where('Recepcion_id','like','%'.$search.'%')
        ->orderby('fecha','desc')
        ->paginate(7);
        $afiliado = Afiliado::all();
        $estanon = Estanon::all();
        $recepciones = RecepcionMateriaPrima::all()->sortBy("fecha");
        $user = User::all();
        $tipoEntrega = TipoEntrega::all();
---
select * from `afiliados`
select * from `estanons`
select * from `recepcion_materia_primas`
select * from `users`
select * from `tipo_entregas`