app/Http/Controllers/StockController.php

    public function index(Request $request)
    {
      if($request){
        $query=trim($request->get('searchText')); //valida si la peticion trae el campo de busqueda
        $sto= Stock::with('recepcionEstanon')
            ->where('id','LIKE','%'.$query.'%')
            ->orderby('id','desc')
            ->paginate(7);
---
select count(*) as aggregate from `stocks` where `id` LIKE '%%'