app/Http/Controllers/StockController.php

    public function index(Request $request)
    {
      if($request){
        $query=trim($request->get('searchText')); //valida si la peticion trae el campo de busqueda
        $sto= Stock::with('RecepcionEstanon')
            ->where('Nombre','LIKE','%'.$query.'%')
            ->orderby('id','desc')
            ->paginate(7);
            $recepcionEstanon = RecepcionEstanon::all();
---
select count(*) as aggregate from `stocks` where `Nombre` LIKE '%%'
select * from `recepcion_estanons`