app/Http/Controllers/Admin/DashboardController.php

    public function index()
    {
        $counts = [
            'users' => \DB::table('users')->count(),
           // 'users_unconfirmed' => \DB::table('users')->where('confirmed', false)->count(),
           // 'users_inactive' => \DB::table('users')->where('active', false)->count(),
           'protected_pages' => 0,
           'afi' => \DB::table('afiliados')->count(),
           'recep' =>\DB::table('recepcion_materia_primas')->count(),
           'api'=>\DB::table('apiarios')->count(),
           'cera'=>\DB::table('ceras')->count(),
           'product'=>\DB::table('products')->count(),
---
select count(*) as aggregate from `afiliados`
select count(*) as aggregate from `recepcion_materia_primas`
select count(*) as aggregate from `apiarios`
select count(*) as aggregate from `ceras`
select count(*) as aggregate from `products`


        $chart2 = new LaravelChart($chart_options);

        $users = User::where(DB::raw("(DATE_FORMAT(created_at,'%Y'))"),date('Y'))
        ->get();
---
select * from `users` where (DATE_FORMAT(created_at,'%Y')) = '2019'


//Afiliados CHART

$afi = Afiliado::where(DB::raw("(DATE_FORMAT(created_at,'%Y'))"),date('Y'))
    				->get();
---
select * from `afiliados` where (DATE_FORMAT(created_at,'%Y')) = '2019'

    public function indexRecepcion(){

        $counts = [

           'afi' => \DB::table('afiliados')->count(),
           'recep' =>\DB::table('recepcion_materia_primas')->count(),
           'api'=>\DB::table('apiarios')->count(),
           'cera'=>\DB::table('ceras')->count(),
           'product'=>\DB::table('products')->count(),
           'ingreso'=>\DB::table('detalle_ingreso')->sum('precio'),


        ];

//Recepcion chart
$chart_options = [
    'chart_title' => 'Recepción por día',
    'report_type' => 'group_by_date',
    'model' => 'App\RecepcionMateriaPrima',
    'group_by_field' => 'created_at',
    'group_by_period' => 'day',
    'chart_type' => 'bar',
];
$chart = new LaravelChart($chart_options);

$recep = RecepcionMateriaPrima::where(DB::raw("(DATE_FORMAT(created_at,'%Y'))"),date('Y'))
    				->get();
---
select count(*) as aggregate from `afiliados`
select count(*) as aggregate from `recepcion_materia_primas`
select count(*) as aggregate from `apiarios`
select count(*) as aggregate from `ceras`
select count(*) as aggregate from `products`
select sum(`precio`) as aggregate from `detalle_ingreso`
select * from `recepcion_materia_primas` where (DATE_FORMAT(created_at,'%Y')) = '2019'

    public function indexIngreso(){

        $counts = [

           'afi' => \DB::table('afiliados')->count(),
           'recep' =>\DB::table('recepcion_materia_primas')->count(),
           'product'=>\DB::table('products')->count(),
          'ingreso'=>\DB::table('detalle_ingreso')->sum('precio'),
---
select count(*) as aggregate from `afiliados`
select count(*) as aggregate from `recepcion_materia_primas`
select count(*) as aggregate from `products`
select sum(`precio`) as aggregate from `detalle_ingreso`