app/Http/Controllers/Admin/UserController.php

    public function index(Request $request)
    {
        if($request){
            $query=trim($request->get('searchText')); //valida si la peticion trae el campo de busqueda
            $users= User::with('roles')->where('name','LIKE','%'.$query.'%')
            ->orderby('id','desc')
            ->paginate(10);

            $roles = Role::all();
---
select * from `users` where `name` LIKE '%%' order by `id` desc limit 10 offset 0
select `roles`.*, `users_roles`.`user_id` as `pivot_user_id`, `users_roles`.`role_id` as `pivot_role_id` from `roles` inner join `users_roles` on `roles`.`id` = `users_roles`.`role_id` where `users_roles`.`user_id` in (1, 2, 3, 4, 9, 25)
select count(*) as aggregate from `users` where `name` LIKE '%%'
select * from `roles`